[
    null,
    null,
    {
        "name": "Backend-разработчик Python",
        "salary": "от 2 000 € до вычета налогов",
        "skills": [
            "Python",
            "AWS",
            "Django Rest Framework",
            "Django",
            "Английский язык",
            "Git",
            "Atlassian Jira",
            "Agile",
            "Английский — B2 — Средне-продвинутый"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Привет! Ты готов работать с крупнейшими европейскими компаниями и воплощать амбициозные проекты в жизнь? Тогда мы ждем именно тебя!  Мы предлагаем уникальную возможность для талантливых специалистов, таких как ты, присоединиться к нашей команде и работать над захватывающими проектами на международном уровне. Мы стремимся открыть двери к новым горизонтам для профессионалов, предоставляя им доступ к крупным и интересным задачам. Что мы предлагаем: - Проект, который вдохновляет: Ты будешь работать над внедрением современных технологий для мониторинга и оптимизации объектов. Ожидай увлекательную работу с данными, инновационными устройствами и системами, которые помогут улучшить процессы и повысить эффективность. - Технологии будущего: Реализация Backend-сервисов на основе Rest/JSON с использованием Python, работа с микросервисными фреймворками и облачной инфраструктурой Amazon AWS. - Международная команда: Работай в мультикультурной среде с коллегами из разных уголков мира, обменивайся опытом и учись новому. Твои задачи: - Разработка и поддержка микросервисов. - Реализация технических концепций и требований клиентских решений. - Документирование архитектурных компонентов и системных интерфейсов. - Участие на всех этапах жизненного цикла разработки: от проектирования до эксплуатации. - Работа по гибким методологиям (Scrum/Kanban). Что мы ищем: - Высшее образование (бакалавр/магистр). - Опыт работы с Python не менее 3 лет, желательно 5 лет и более. - Опыт работы с Django и Django REST Framework (DRF). - Опыт с Infrastructure as Code (IaC). - Глубокие знания AWS и микросервисной архитектуры. - Опыт работы с DF Microservice. - Навыки работы с Git и Jira. - Отличные коммуникативные навыки и знание английского языка. - Опыт работы по методологиям AGILE (Scrum и Kanban). Мы предлагаем: - Долгосрочные проекты: Контракты до 5 лет с возможностью участия в других проектах по завершении текущего. - Гибкость: Работай удаленно из любой точки мира. - Профессиональный рост: Участие в сложных и интересных проектах на международном уровне. - Финансовая стабильность: Работа с европейскими компаниями и возможная индексация зарплаты согласно курсу евро. - Прозрачные условия: Четко оговоренные условия сотрудничества и оплаты труда. - Офис в Минске: Если вы находитесь в Республике Беларусь и Минске, возможно работать в офисе компании. Процесс отбора: 1. Предварительный отбор по ключевым критериям – заполнение анкеты. 2. Предоставление резюме на английском языке. 3. Собеседование (уровень английского, технические навыки, финальное с клиентом). 4. Оформление и подключение к проекту. Мы ждем тебя! Если ты хочешь развивать свои навыки и работать над интересными проектами с лучшими компаниями Европы, присоединяйся к нам. Отправляй свое резюме и давай создавать будущее вместе! P.S. Если у тебя возникли вопросы или нужна дополнительная информация, не стесняйся обращаться. Мы всегда рады помочь и предоставить необходимую поддержку. Ждем твоего отклика и надеемся на плодотворное сотрудничество!"
    },
    {
        "name": "Junior Python RPA Developer",
        "salary": "от 150 000 ₸ на руки",
        "skills": [
            "Python",
            "ООП",
            "Английский язык",
            "RPA",
            "Опытный пользователь ПК",
            "Алгоритмы и структуры данных",
            "PyCharm"
        ],
        "experience": "не требуется",
        "employment_mode": [
            "Полная занятость, гибкий график"
        ],
        "description": "Обязанности:  Автоматизация бизнес процессов клиентов с использованием технологии Robotic process automation (just google it) Используемые решения: Python, Selenium, Python RPA Platform (наш собственный low-code инструмент разработки)  Требования:  Умение быстро обучаться, высокая мотивация, ответственность! Обязательно: Знание Python, ООП, структуры данных, базовые алгоритмы и понимание их сложности, базовое знание HTML/CSS/JS, базовый Git Английский: желательно intermediate и выше Желательно (будет плюсом): Selenium / Pupeteer, REST API, SQL, базовое знание как устроены сети (на уровне понимать что такое VPN/Proxy), как настраивать windows (уровня опытного пользователя) Так же Берем выпускников и студентов 4го курса  Условия:  Работа офис / удаленка (гибрид) - понедельник - пятница Официальное трудоустройство  О нас:  Ранее назывались Seiko labs (попали в Forbes). Являемся лидером на рынке РК, выходим на зарубежные рынки США/Индия и т.п. Единственный в РК стартап разработчик собственной RPA платформы (IDE) Получили венчурное финансирование от иностранных фондов с оценкой в $3 млн. Основатели выходцы из BIG4, выпускники зарубежных вузов. "
    },
    {
        "name": "Разработчик Python",
        "salary": "от 800 000 до 1 000 000 ₽ до вычета налогов",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Частичная занятость, полный день"
        ],
        "description": "Разработчик Python с опытом работы с OpenAI   Описание вакансии:   Мы ищем опытного Python разработчика для работы над проектом ExecutiveAI. Ваша задача будет состоять в разработке и интеграции AI-советника для автоматизации бизнес-процессов и улучшения взаимодействия с клиентами и сотрудниками. Если у вас есть опыт работы с OpenAI API и вы хотите принять участие в инновационном проекте, мы будем рады видеть вас в нашей команде.   Обязанности:  Разработка и настройка моделей на базе OpenAI API. Сбор, очистка и анализ данных. Разработка серверной части приложения. Создание и поддержка пользовательского интерфейса. Интеграция AI-решений в существующие бизнес-процессы. Оптимизация производительности и качества работы моделей.  Требования:  Опыт работы с Python не менее 3 лет. Знание и опыт работы с OpenAI API. Опыт работы с веб-фреймворками (Flask, Django). Знание основ обработки и анализа данных. Навыки работы с базами данных (SQL, NoSQL). Умение работать в команде и хорошие коммуникативные навыки.  Условия:  Долгосрочное сотрудничество. Удаленная работа с гибким графиком. Конкурентоспособная оплата труда. Возможность профессионального роста.  Если у вас есть желание присоединиться к нашему проекту и внести свой вклад в развитие ExecutiveAI, мы будем рады рассмотреть вашу кандидатуру.  "
    },
    {
        "name": "Бэкенд разработчик (Python/Django), программист, TON",
        "salary": "от 200 000 до 400 000 ₽ до вычета налогов",
        "skills": [
            "TON"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Мы ищем опытного бэкенд разработчика для разработки и поддержки беззалогового кредитного протокола в блокчейне TON. Идеальный кандидат должен обладать сильными навыками в Python и Django, а также иметь опыт работы с различными технологиями и инструментами, такими как PostgreSQL, Ninja, RabbitMQ, Docker, Docker Compose и CI/CD. Опыт работы с TON является большим плюсом. Обязанности:• Разработка и поддержка серверной части кредитного протокола на блокчейне TON.• Проектирование и реализация RESTful API с использованием Ninja и Django.• Работа с базой данных PostgreSQL для хранения и обработки данных.• Настройка и управление очередями задач с использованием RabbitMQ.• Контейнеризация приложений с использованием Docker и Docker Compose.• Настройка и управление процессами CI/CD для автоматизации развертывания и тестирования.• Оптимизация и масштабирование существующих систем.• Работа в тесном сотрудничестве с командой фронтенд разработчиков для обеспечения согласованности между серверной и клиентской частями приложения.• Опыт работы с блокчейном TON является большим плюсом. Условия:• Работа в офисе в Москва Сити.• Гибкий график.• Конкурентоспособная заработная плата.• Участие в инновационных проектах в сфере блокчейна.• Современный офис с удобной инфраструктурой."
    },
    {
        "name": "Python developer",
        "salary": "",
        "skills": [
            "Python",
            "SQL",
            "Mongo db",
            "Fast api",
            "Docker",
            "Pytest"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Компания UBIC Technologies - создана в 2007 году и является разработчиком передовых инфраструктурных решений на основе конфиденциальных вычислений и машинного обучения. Данные решения нашли своё применение в госсекторе, банковской сфере, телекомах и маркетинге. Компания накопила значительные компетенции в области обработки и анализа больших данных, SmartCity, телекоммуникаций и финтеха. Мы создаем B2C, B2B и B2G продукты, используя широкий стек современных технологий. Проект: Основной проект — платформа совместных безопасных вычислений, которая проводит скоринг клиентов банков для оценки кредитного рейтинга. - Программирование распределенных вычислений; - Участие в R&D, то есть решение задач, которые до нас еще не решали; - Участие в разработке архитектурных решений; - Участие в кодревью; - Написание тестов Наш Стек:Python 3, FastAPI, Docker, Docker-compose, pytest, PostgreSQL, Redis Мы ждем: - От 3 года опыта разработки на python; - Понимание принципов Python-разработки; - Опыт с SQL/NoSQL базами данных, с docker; - Опыт с любым REST-фреймворком; - Знакомы со стандартными инструментами под классические задачи (очереди задач, базы данных, кеш, реверс-прокси, load-balancer, и т.д.); - Хорошее знание общих вопросов программирования: паттерны проектирования, структуры данных, классические алгоритмы; - Понимаете ĸаĸ работает асинхронность; - Не боитесь зайти на сервер и развернуть руками свой код Будет плюсом: - Опыт работы с микросервисной архитектурой; - Опыт работы с CI/CD на проекте, опыт работы с инфраструктурой (например, bash) - Опыт работы с Django/drf Мы предлагаем:  Оформление в соответствии с ТК РФ и полностью «белый» доход; Работа в аккредитованной ИТ компании; Конкурентный уровень заработной платы - мы высоко оцениваем любой вклад в развитие наших проектов; Комфортный график работы удаленно/гибрид/в офисе с гибким началом рабочего дня (офис Мск, м. Новокузнецкая/Третьяковская); Оборудование на выбор: Windows, Linux или Maс. Ноутбук или стационарный компьютер и любое разумное число мониторов; Занятия английским языком за счет компании; Возможность оплаты профессиональных курсов и повышения квалификации; Правильный отдых. Например, новогодний корпоратив 2019/2020 был в Иордании, осень 2020/2021 встречали в Сербии, весна 2023 были в Омане, в этом году летали в Грузию, грандиозные планы на 2025 год; Душевные посиделки в офисе (у нас есть приставки и настольный теннис во дворе). "
    },
    {
        "name": "Python разработчик",
        "salary": "",
        "skills": [],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "В Центре Разработок Т-Банка Python является одним из самых распространенных языков разработки. На нем мы пишем многие сложные и нагруженные проекты. Поэтому ищем опытных разработчиков Python, которые смогут привнести экспертизу и вывести наши продукты на новый уровень Нам всегда есть, что предложить начиная с внутренних проектов, заканчивая широко востребованными клиентскими продуктами Обязанности  Проектирование компонентов систем Организация процесса разработки Написание и ревью кода Написание тестов на свой код Наставление менее опытных коллег  Требования  Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет Опыт многопоточного и асинхронного программирования Опыт работы с фреймворками: FastApi, Flask или другими Опыт работы с реляционными СУБД (PostgreSQL, Mysql) Опыт построения распределённых высоконагруженных сервисов Знание и применение паттернов проектирования Будет плюсом опыт использования технологий Kafka/Cassandra/Clickhouse/Redis/Elasticsearch  Мы предлагаем  Работу в офисе. График работы — гибридный  Платформу обучения и развития Т-Апгрейд. Курсы, тренинги, вебинары и базы знаний. Поддержка менторов и наставников, помощь в поиске точек роста и карьерном развитии  Активное комьюнити python разработчиков  Готовим спикеров на внешние митапы и конференции Проводим внутренние митапы Разрабатываем внутренние innersource проекты Проводим встречи литературного клуба   Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Предложим льготное страхование вашим близким Компенсацию такси и 50% затрат на спорт от стоимости абонемента Компенсацию обедов. А если захотите перекусить, есть кухня с чаем, кофе и фруктами Достойную зарплату — обсудим ее на собеседовании Возможность работы в аккредитованной ИТ-компании "
    },
    {
        "name": "Разработчик Python",
        "salary": "",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "      Известный российский бренд в сфере машиностроения, развивающий проекты в системной интеграции и робототехники, в связи с расширением штата в поиске Python-разработчика.При отклике обязательно указывайте свой ожидаемый доход!       Обязанности:  Поддержка и разработка собственных решений компании в сфере промышленной робототехники и автоматизации; Работа с системой контроля версий на базе Git; Участие в разработке архитектурных решений и логики работы систем; Работа в команде над общими задачами по Scrum-системе; Участие в оценке задач, планированиях; Участие в обучении и поддержки младших коллег; Выездные тестирования ПО на производственной площадке на реальном железе; Проведение отладки разработанного ПО и исполнительных программ; Подготовка и оформление рекомендаций и соответствующих разделов технической документации для ПО и исполнительных программ.  Будет преимуществом:  Опыт работы с ROS/ROS2; Умение собирать Python библиотеки из исходного кода.    Требования:  Знание синтаксиса, алгоритмов, принципов, основных библиотек, типов данных языка Python; Умение работать с Git; Знание сетевых протоколов и умение работать с ними TCP/IP (ModbusTCP, EthernetIP); Знание Unix-систем на высоком уровне; Знание систем баз данных (SQLite, PostgreSQL) и работы с ними; Знание принципов тестирования и умение работать с GitHub Actions и pytest/unittest; Умение составлять документацию, следовать принципам корпоративного стиля кода; Умение работать с асинхронными программными решениями; Умение работать с pip; Знание документации pep8; Технический и разговорный английский не ниже уровня B2 (работа с документацией, переписка и встречи с англоязычными коллегами).  Условия:  Оформление по ТК РФ; Комфортный офис в современном БЦ возле м. Сходненская, готовы рассмотреть гибридный формат работы; График работы 5/2 с 08:00 до 16:30; Полностью \"белая\" и привлекательная заработная плата (обсуждается в рамках собеседования); ДМС после прохождения испытательного срока; Корпоративная мобильная связь, мобильный телефон и ноутбук. "
    },
    {
        "name": "Python Developer",
        "salary": "",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "LuckyGroup — экосистема партнёрского маркетинга. Мы развиваем проекты в области рекламы и Affiliate Marketing (LuckyAds, LuckyOnline, LuckyFeed, LuckyCenter, LuckyTeam и другие), активно участвуем в жизни сообщества партнерского маркетинга, проводим конференцию CPA Life, собирая всех представителей индустрии вместе. Мы создаем высоконагруженные «умные» системы и инструменты, которые помогают получить максимум эффективности при работе с интернет-рекламой и в связи с расширением в новый отдел API, который будет развивать наши продукты, ищем сильного Python разработчика.   Чем предстоит заниматься:   Разработка API, связывающего между собой сервисы;   Написание ETL-процессов;   Участие в проектировании системы и разборе новых задач;   Участие в жизни и процессах команды.   Стек технологий:  Язык: Python библиотека написания API - FastAPI Базы данных: PostgreSQL, CockroachDB Логи: ELK Метрики: Prometheus, Grafana Task tracker: Jira Документация: Confluence  Наши ожидания:  Уверенные знания языка программирования Python, опыт от 2х лет (FastAPI); Опыт коммерческой разработки клиент-серверных приложений от 2х лет; Понимание принципов написания API; Умение проектировать базы данных; Уверенная работа с системами контроля версий (Git);  Мы:  Даем выбор: полная удаленка, офис или гибридный график (удаленка/офис); Предлагаем атмосферу молодой компании, гибких процессов и прозрачности; Оформляем по ТК РФ и всё, что с этим связано; Предоставляем ДМС после испытательного срока, а еще у нас есть корпоративный врач! Поддерживаем стремление к развитию: корпоративные скидки на обучение от партнеров; Доверяем: есть возможность взять 3 дня в квартал по болезни, без официального подтверждения; Работаем 5/2, гибкий старт дня с 09:00 до 11:00; Находимся в шаговой доступности от м. Василеостровская или м. Спортивная-2  Будем рады твоему отклику! :)  "
    },
    {
        "name": "Python разработчик",
        "salary": "",
        "skills": [
            "Python",
            "Docker",
            "GitlabCI",
            "Kubernetes",
            "PostgreSQL"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Привет! АО Банк Синара — один из крупнейших региональных российских банков (ранее – СКБ-Банк), в ноябре 2020 года отметил тридцатилетие. Банк входит в финансово-промышленный холдинг Группа Синара (СКБ-ЛАБ, АО Синара Банк, Газэнергобанк, ТМК-трубная металлургическая компания, Синара-Девелопмент и др.), который объединяет 45 предприятий и 32 000 сотрудников. СКБ ЛАБ - это передовой IT-проект. Он создан для разработки абсолютно нового интернет-банка и мобильных приложений для него, как для физических, так и для юридических лиц. Слаженная команда IT-профессионалов Банка Синара самостоятельно разрабатывает и сопровождает финансовые сервисы для обслуживания клиентов онлайн и в офисах банка. Если Вы хотите попасть в крутую команду профессионалов, работать и развиваться вместе в сообществе – наше предложение о работе то, что Вы искали.   Чем предстоит заниматься:  Разработка чат бота; Разработка комплексных сервисов по работе с моделями ИИ и различным API; Разработка сервисов работы с данными - обработка, преобразование, анализ; Сборка и инфраструктура - GitlabCI, Docker, k8s, Apache Kafka, СУБД - PostgreSQL, Grafana; Активное взаимодействие с внутренними заказчиками, аналитиками, разработчиками.    Что для нас важно:  Высшее образование; Опыт программирования Python от 2 лет; Опыт проектирования и разработки сервисов различного уровня сложности; Работа с Api, СУБД. Понимание принципов построения CI/CD.    Что мы предлагаем:    Официальное трудоустройство. Полностью белая заработная плата со всеми налоговыми отчислениями; Достойная оплата. Оговариваем по результатам собеседования, основываясь на ваши технические навыки и ожидания; Заботимся о здоровье. ДМС после прохождения испытательного срока; Рост. Профессиональное обучение, возможность повышения квалификации. Карьерный рост зависит от твоего развития внутри компании; Увлекательная корпоративная жизнь: конкурсы, спортивные мероприятия, корпоративы, возможность заработать брендированную продукцию; Комфорт работы. Гибрид или 100% удаленка.    Ждем тебя на встрече в нашем офисе или онлайн! Обсудим больше подробностей. Если возникнут вопросы, смело пиши или звони."
    },
    {
        "name": "Программист Python",
        "salary": "",
        "skills": [
            "Python",
            "MATLAB",
            "Математический анализ",
            "Математическое моделирование",
            "Математическое программирование",
            "pandas",
            "Machine Learning",
            "Numpy",
            "Data Analysis",
            "Matplotlib",
            "SciPy",
            "Deep Learning",
            "Data Science",
            "Машинное обучение",
            "Scikit-learn",
            "Maple",
            "PyTorch",
            "TensorFlow",
            "Computer Vision",
            "C++",
            "C#"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Наша компания занимается предоставлением полного спектра услуг по разработке ПО для заказчиков со всего мира.У компании несколько офисов – девелоперские центры в Ростове-на-Дону (головной офис), а так же офисы продаж в Мельбурне (Австралия) и Тель-Авиве (Израиль).Мы предоставляем услуги web-разработки, мобильной разработки, десктопной разработки, разработки в области data science, проектирования, тестирования и создания UX/UI-дизайна. Мы приглашаем на работу Python разработчиков в отдел Data Science в головной офис в Ростове-на-Дону. Если Вам интересно заниматься инновационными разработками, если Вы хотите работать над сложными задачами, решение которых еще не было найдено, если Вы любите науку и хотите развиваться, эта работа для Вас! Рассматриваем соискателей только на работу в офисе. Удаленного формата работы нет.   Чем предстоит заниматься:  участвовать как в больших энтерпрайз проектах, так и в решении маленьких задач для оптимизации процессов; разрабатывать модели tts, stt, nlp, cv; изучать и применять алгоритмы; разрабатывать механизмы взаимодействия с моделями (Kafka, Django, FastAPI); разрабатывать AI сервисы в рамках больших микросервисных проектов.    Требования:  IT образование (допускается неоконченное); ответственность; обучаемость; умение работать в команде; приветствуется наличие примеров Ваших программ.  Обязательные скиллы:    знания и опыт разработки Python; знакомство с другими языками программирования или математическими пакетами (R, Matlab, C++, C#); навыки обработки текстов на естественных языках; опыт работы на различных версиях среды разработки; знание базовых алгоритмов и структур данных, понимание принципов оценки эффективности алгоритмов; умение быстро искать информацию в интернете; умение разбираться в чужом коде.  Будет плюсом:    знания в одной или нескольких из следующих областей:- компьютерное зрение, обработка изображений;- обработка текстов на естественных языках;- работа со звуком;- машинное обучение;- обработка сигналов;- математическое моделирование. желание развиваться в области прикладной математики, машинного обучения и программирования; английский на уровне чтения профессиональной литературы (по математике и программированию), а также написания технической документации.  ​​​​ Условия:  оформление согласно Трудовому Кодексу РФ; восьмичасовой рабочий день. Обеденный перерыв 1 час + два кофе-брейка по 15 минут; гибкое начало рабочего дня; достойная заработная плата; оплачиваемые переработки (9-й и 10-й час в день по тарифу 150%‚ 11-й и далее по тарифу 200%); система премирования; только крупные и сложные проекты; работа с инновационными технологиями, о которых другие компании боятся даже подумать; профессионально выстроенная система обучения сотрудников по всем направлениям работы компании; большой и дружный коллектив, где всегда присутствует атмосфера взаимопомощи при возникновении любых вопросов; работа только ради результата, а не ради процесса; уважительное отношение к сотрудникам; регулярная обратная связь; корпоративный транспорт для жителей отдаленных районов; комплексные обеды (собственная столовая с поваром); современный‚ технологичный и уютный офис (1100 кв.м) с огромным количеством зелени; неограниченная парковка для сотрудников компании; кофе, чай, снэки (перекусы); доступный досуг (настольный футбол, настольный теннис, PlayStation VR‚ Sega Mega Drive 2, сцена с профессиональным музыкальным оборудованием, массажное кресло Yamaguchi YA-6000); много зон отдыха внутри офиса; своя большая территория с лавочками, деревьями и зелеными газонами; Crossfit-площадка; все вышеперечисленное - правда. "
    },
    {
        "name": "Программист Python",
        "salary": "от 80 000 до 100 000 ₽ на руки",
        "skills": [
            "Python",
            "PostgreSQL",
            "Работа с базами данных",
            "Обучение и развитие",
            "Анализ данных",
            "Selenium IDE",
            "FastAPI",
            "Alembic",
            "Git",
            "SQLAlchemy",
            "React"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "RICHE — российская косметическая компания c современной лабораторией и собственным производством. Создает продукты по уходу за лицом, телом и волосами. При создании продуктов сотрудничает с опытными ведущими косметическими лабораториями мира, уделяя особое внимание новейшим научным открытиям. Работа НЕ УДАЛЕННАЯ, в офисе!!! Обязанности:  Автоматизация внутренних процессов компании; Разработка сервисов для анализа большого объема информации; Написание сервисов парсинга сайтов; Написание и поддержка документации к созданным сервисам; Понимание принципов работы API для сбора данных из внешних источников; Разработка back-end части на FastAPI/Alembic/SQLAlchemy/aiogramm; Знание REACT будет плюсом.  Требования:  Опыт работы с базами данных, включая проектирование схем, оптимизацию запросов и обеспечение целостности данных; Знания стек: Python3.10+/PostgreSQL/Selenium/JS/git.  Мы предлагаем:  Развитую систему премирования, справедливую оценку результатов работы (ежемесячные и ежеквартальные премии); Оформление в соответствии с Трудовым Кодексом РФ с первого дня; Полноценная белая заработная плата + своевременные выплаты без задержек 2 раза в месяц; Корпоративное обучение (возможность пройти интересные обучения, направленных на профессиональное развитие нашей команды).   "
    },
    {
        "name": "Разработчик Python",
        "salary": "",
        "skills": [
            "Python",
            "FastAPI",
            "PostgreSQL",
            "asyncio",
            "aiohttp",
            "SQLAlchemy",
            "Alembic",
            "pydantic",
            "Celery",
            "RabbitMQ"
        ],
        "experience": "более 6 лет",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Здравствуйте! Инфомедиа — многопрофильная компания, прошедшая IT-аккредитацию.Мы проектируем, разрабатываем, внедряем и сопровождаем инновационные цифровые продукты, а также снимаем кино.Среди наших клиентов — РЖД, Росатом, Автодор, Сбербанк.В нашем портфеле проектов:  корпоративные сайты (топовые компании страны) интерактивные стенды, мобильные приложения, AR/VR интерактивы, рекламные концепции для музеев геоинформационные сервисы историко-просветительские проекты выставочные проекты (интерактивные стенды, айдентика мероприятий, мерч, сувенирная и печатная продукций) игровые проекты (web, mobile, desktop, VR) VR тренажеры для технологических компаний системы обучения в VR для ВУЗов  Сейчас мы расширяемся и ищем в нашу команду разработчика Python Задачи:  Руководство командой из 2-3 разработчиков; Разработка бэкенд платформы компании с нуля; Разработка сервисов авторизации, обработки изображений и видео, сбора статистики и мониторинга; Разработка сервисов интеграции систем; Автоматизация отчетности и работа с уведомлениями.  Мы ожидаем от вас:  Высшее техническое образование; Подтверждённый опыт разработки на Python более 5 лет.  Hard skills:  Экспертное знание Python, опыт коммерческой разработки 5-7 лет Опыт проектирования сложных систем и сервисов Опыт оптимизации производительности и работы с высоконагруженными системами/микро сервисами Умение и желание покрывать свой код тестами Глубокое знание одного из фреймворков (FastAPI/Flask/Django) Опыт наставничества и обучения младших разработчиков Хорошее знание как чистого SQL так и ORM Опыт работы с реляционными и нереляционными базами данных Понимание принципов ООП, SOLID, RESTful API Знание ОС Linux / Docker / Docker compose Опыт работы с Git Знание DevOps технологий и умение настроить CI/CDSoft skills:   Желание и способность обучаться и адаптироваться; Умение решать сложные технические проблемы; Коммуникабельность; Способность работать в условиях неопределенности и меняющихся требований.  Мы предлагаем:  Интересные и амбициозные проекты; Профессиональный рост; Работа в штате в IT-аккредитованной компании; Удаленно (при желании можно приезжать и в офис на Цветном бульваре (Москва)); Оформление по ТК РФ; Уровень з/п обсуждается индивидуально. "
    },
    {
        "name": "Python Developer",
        "salary": "",
        "skills": [
            "PostgreSQL",
            "Python",
            "Английский язык",
            "Web Application Development",
            "Docker",
            "Разработка мобильных приложений",
            "remote",
            "Django",
            "Git",
            "Kafka",
            "Базы данных"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Присоединяйтесь к нашей инновационной финтех компании Fingular и станьте частью нашего масштабного проекта развития онлайн-банка в Юго-Восточной Азии! Обязанности:   Проектирование и разработка сервисов.   Вы будете вовлечены в создание инновационных решений, которые определяют будущее финансовых технологий.   Контроль качества кода, проведение code-review.   Ваш профессионализм и внимание к деталям помогут нам поддерживать высокие стандарты разработки.   Оценка задач и участие в планировании работ.   Ваш взгляд на задачи и опыт будут важными элементами в нашем стратегическом планировании.   Участие в разработке архитектуры приложения.   Вы сможете внести свой вклад в формирование структуры приложения, делая его более совершенным. Требования:   Высшее техническое образование.   Опыт работы разработчиком от 5 лет.   Отличное знание Python и PostgreSQL.   Умение писать запросы не только через ORM.   Опыт проектирования и реализации API для веб и мобильных приложений.   Будет плюсом:   Опыт создания высоконагруженных систем и сервисов.   Работа с облачными сервисами: AWS / Yandex.Cloud / Azure / Alibaba Cloud.   Опыт с контейнеризацией (Docker, Docker Compose, Kubernetes).   Опыт в fintech.   Хороший разговорный английский.   Мы предлагаем:   Удаленную работу.   Профессиональную команду, которой мы гордимся.   Адекватность руководства и демократичность процесса разработки.   Возможность влиять на проект и вносить свои предложения.   Гибкий рабочий график для оптимального баланса между работой и личной жизнью.   Join us and be part of the fintech revolution with Fingular! The possibilities are endless.  "
    },
    {
        "name": "Python developer / Разработчик python",
        "salary": "",
        "skills": [
            "Анализ данных"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "За последние 2 года мы (IQnergy) выросли в 5 раз. Мы помогаем O’KEY, Додо Пицца, Hoff, Ташир (ТЦ РИО), X-Fit и еще 10-и сетями магазинов и ресторанов следить за климатом в помещениях, автоматически управлять оборудованием и экономить энергию (умный дом для коммерческих зданий).   Ищем пополнение в наш команду разработки – аналитика, который поможет автоматизировать диагностику и поиск аномалий работы оборудования.   Как мы работаем:  Быстрые итерации (релизы раз в 2 недели); Обсуждение и тестирование гипотез совместно с клиентом; Проверка качества кода (code review).    Чем придется заниматься:  Писать качественный код python; Разрабатывать модули обработки и анализа данных; Придумывать алгоритмы поиска поломок оборудования.    Ты идеальный кандидат(ка) если:  Имеешь опыт разработки python в большой ИТ компании или стартапе на стадии роста У тебя техническое образование: МФТИ, МГУ (ВМК, МехМат, Физфак), МГТУ им. Баумана и подобное; Хорошо, если ты знаешь современные методы анализа данных, в т.ч. анализа и прогнозирование временных рядов, методы классификации; будет плюсом если знаешь библиотеки анализа данных: Pandas, NumPy, SciPy, scikit-learn      Условия:  Достойная компенсация, которая позволит вам сосредоточиться на развитии проекта и своем профессиональном росте; Сильная и мотивированная команда – у вас будет возможность обмениваться опытом и расти профессионально; Сложные и интересные задачи, в том числе реальная практика в построении разработки и реализации алгоритмов анализа данных;   Комфортные условия работы – офис в 5-и минутах от метро Нагатинская; Возможности для быстрого роста вместе с компанией. "
    },
    {
        "name": "Разработчик Python",
        "salary": "до 150 000 ₽ на руки",
        "skills": [
            "Python",
            "PostgreSQL",
            "Django Framework",
            "Flask",
            "asyncio",
            "MongoDB"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Над чем предстоит работать: • Разработка интеллектуальных систем• Участие в разработке и проектирования ПО для приема, обработки и визуализации данных с различных летательных аппаратов (материалы аэро- и лидарной фотосъёмки, видео, телеметрические данные, радиолокационных данных)• Разработка интеграционных и служебных сервисов (API для web-приложений) Стек технолоий: - Python (Python 3.7 и выше): SqlAlchemy, Django, Flask, FastAPI- REST, Swagger- Git- PostgreSQL, MongoDB, Redis- RabbitMQ, Celery- AMQP, MQTT- Pytest- ОС: Debian11, Astra LInux 1.7 Требования: • Уверенное владение Python3 от 2 лет, знание его окружения (стандартные библиотеки и библиотеки на базе фреймворков)• Понимание базовых принципов работы HTTP, TCP/IP, UDP• Покрытие кода тестами• Опыт проведения code review• Linux, Git, SQL• Понимание CI Будет плюсом: - Знание ГИС ( PostGIS, Google Maps API, mapproxy, OpenLayers, GeoDjango)- Опыт работы с библиотеками gdal, openCV, gstreamer, ffmpeg, cvlc- Понимание приемов функционального программирования- Базовые понимания стеков передачи данных- Опыт работы с Docker, GitLab CI Что мы предлагаем: • Конкурентная заработная плата по итогам собеседования, мы готовы обсуждать исходя из вашего опыта и пожеланий• Интересная, многоплановая работа в социально значимых и наукоемких проектах• Официальное оформление с первого дня, оплачиваемый отпуск и больничный в соответствии с ТК РФ• ДМС• График 5/2 в офисе (учитывая специфику проектов, мы, к сожалению, не можем предложить удаленный формат)• Гибкое начало рабочего дня• Молодой дружный коллектив, отсутствие формализма и демократичная обстановка• Корпоративный спорт (баскетбол) в современном фитнес клубе в Петроградском р-не• Комната отдыха, кофемашина и чай• Вело и автопарковка• Работа в офисе в 15 минутах от м. Петроградская, в двух минутах от Аптекарской набережной и Лопухинского сада Будем признательны, если при отклике на нашу вакансию вы укажите ожидаемый уровень заработной платы, если он не указан в резюме. Спасибо!"
    },
    {
        "name": "Python разработчик",
        "salary": "",
        "skills": [
            "Python",
            "SQL",
            "GitHub",
            "Django",
            "DFR",
            "Socket",
            "Celery",
            "Redis"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Частичная занятость, удаленная работа"
        ],
        "description": "Обязанности:   Разработка и поддержка веб-приложений на Python.   Работа с фреймворком Django, DFR.   Работа с Socket, Redis, Celery, Git.     Умение писать API клиенты для учетных систем, писать свои API эндпоинты для сторонних клиентов.    Интеграция с базами данных и системами хранения данных.   Написание чистого, модульного, тестируемого кода.   Опыт работы с платежными системами Halyk Pos, Epay и Apple pay  Опыт создания полноценных сервисов на Django в сфере BI.   Требования:  Опыт программирования на Python не менее 2 лет. Знание систем управления базами данных и SQL.  Условия:  Гибкий график работы и возможность удаленной работы. "
    },
    {
        "name": "Разработчик Python",
        "salary": "",
        "skills": [
            "Python",
            "PostgreSQL",
            "Git",
            "MongoDB",
            "Английский язык",
            "Английский — C1 — Продвинутый"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Требования к кандидатам:  Опыт разработки на Python от 1 года. Знание аннотации типов Python Знание и понимание HTTP, REST, JSON Опыт работы с PostgreSQL и MongoDB Опыт работы с FastAPI Опыт работы с GIT, Docker Знание UNIX-подобных систем  Будет плюсом:  Опыт отладки и оптимизации комплексных приложений. Опыт анализа данных. Опыт работы с очередями сообщений. Опыт frontend-разработки на React. Знание английского языка. Понимание основ и опыт настройки CI/CD  Условия:  Конкурентная заработная плата (согласовывается по итогам собеседования в зависимости от опыта и навыков) Работа в офисе в центре Екатеринбурга. Интересные проекты. Официальное трудоустройство по ТК. Гибкий график работы после испытательного срока  Рассмотрим, в том числе, кандидатуру студентов"
    },
    {
        "name": "Middle Python-разработчик",
        "salary": "от 150 000 ₽ на руки",
        "skills": [
            "Python",
            "PostgreSQL",
            "Linux",
            "Requests",
            "Selenium",
            "pandas",
            "API",
            "ORACLE",
            "MySQL",
            "Clickhouse"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": " Компания ТОРГЗАП уже более 10 лет делает автолюбителей счастливее, предлагая широкий ассортимент запчастей для любого автомобиля.  Мы продолжаем расти и масштабироваться, поэтому приглашаем в команду новых специалистов;  Вы можете стать частью команды, которая любит интересные задачи и работу на результат. Сейчас мы в поисках Middle Python-разработчика; Если ты обладаешь опытом от 2-х лет, читай вакансию дальше и оставляй свой отклик! Мы предлагаем:   интересные и разнообразные задачи;   работу в комфортном офисе в приятной атмосфере;   график работы 5/2 ( 8-часовой рабочий день);   оформление по ТК РФ;   карьерный рост и развитие (у тебя будет полная свобода для творчества);   заработная плата от 150 000 руб.;    Твои основные обязанности:   работа на python (версия > 3.0)   работа с библиотеками Requests, Selenium Web Driver, Pandas и sys ;   работы с БД (PostgreSQL/Oracle/MySQL/Clickhouse);   работа с базой данных ClickHouse и PostgreSQL (включая SQL и ORM);   использование многопоточность (библиотеки multithreading и multiprocessing);   Будет круто, если у тебя есть:    Знание Python на уровне Middle/Middle+,   Практические навыки работы с библиотеками Requests и Selenium Web Driver, Pandas, sys   Опыт работы с многопоточностью (библиотеки multithreading и multiprocessing)   Навыки работы с БД (PostgreSQL/Oracle/MySQL/Clickhouse),   Навыки работы с API.   Работа в ТОРГЗАП - это интересные задачи для увлеченных специалистов, уютный офис, дружная команда, культура непрерывного обучения, достойная зарплата, финансовые бонусы. Резюме с сопроводительным письмом рассматриваются быстрее! Откликайся :)   "
    },
    null,
    null,
    {
        "name": "Backend-тестировщик-программист (Python)",
        "salary": "",
        "skills": [
            "API",
            "Postman",
            "Тестирование",
            "Test case",
            "Интеграционные тесты",
            "Git",
            "CI",
            "Python",
            "Linux",
            "Docker",
            "Kibana",
            "Bash",
            "JSON",
            "XML",
            "FastApi"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Команда занимается разработкой новых сервисов. Разрабатываем облачные платформенные сервисы для инженеров, ученых, программистов и студентов. Ищем внимательного и самостоятельного тестировщика, способного достигать результата в заявляемый срок работая в распределенной SCRUM команде. Обязанности:  Тестирование Backend;  Написание интеграционных тестов на API методы; (Swagger);   Взаимодействовать с командой разработки;   Составление тестовой документации: тест-кейсы, тест-планы, чек-листы;   Проведение функционального, Е2Е тестирования , интеграционного, регрессионного тестирования;   Заведение и сопровождение баг-репортов;   Проведение анализа результатов тестирования и предоставление отчетов о полученных результатах.   Ожидания от кандидата:     Опыт работы тестировщиком от 1 года;   Работали со Swagger;   Знание Python на уровне Junior для написание тестов;   Опыт тестирования REST API (Jmeter, Postman);   Знание и понимание теории тестирования ПО: методологии тестирования, типы и цели тестирования;   Опыт работы с TMS;   Хорошие аналитические навыки, внимательность и ответственность.   Будет плюсом:     Опыт работы с Git;   Инженерно-техническое образование;   Базовые знания Linux (работа с bash, базовые команды, синтаксис);   Базовые знания Docker (сборка образов, управление контейнерами, запуск тестов в контейнерах);   Опыт работы с системами Continuous Integration (Jenkins, Gitlab);   QA участвует в DevOps процессах CI/CD, так что знания в этом направлении приветствуются;   Опыт проведения нагрузочного тестирования;     Условия:     У нас профессиональный и трудолюбивый коллектив;   Мы всегда открыты к новым идеям и созидательной критике;   Адаптивный рабочий график, удаленная работа с возможностью посещения офиса по желанию;   Обеспечиваются все пожелания, связанные с обустройством эффективного рабочего процесса исследований и разработки;   Стабильная компания, все официально по ТК РФ;   Высокая оплата труда, индивидуально по результатам собеседования.  "
    },
    {
        "name": "Разработчик Python (Junior)",
        "salary": "",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Обязанности:  ​​​​​​​Доработка CRM (на базе Odoo) и ЛК Заказчика на уровне прикладного ПО (Python) Сопровождение развертывания систем на микросервисной архитектуре (Openshift) Участие в проведении приемо-сдаточных испытаний Разработка технических документов: описаний сценариев, интерфейсов, отчетов  Требования:  ​​​​​​​Знание Python и его окружения; Опыт работы с Django (или аналогами); Опты работы с базами данных (PostgreSQL);  Опыт работы с Json, XML; Понимание принципов работы Rest API;- Разработка клиент-серверных приложений на Python - Развертывание систем на микросервисной архитектуре  Условия: ​​​​​​​​​​​​​​  Достойную твоего профессионального уровня заработную плату (уровень вознаграждения обсуждается индивидуально по результатам интервью); Качественную программу ДМС со стоматологией с первого месяца работы; услуги телемедицины, консультации психолога, страхование жизни и здоровья в том числе за границей, льготные условия страхования для близких и возможность расширить перечень клиник по опции Flexible benefits Неограниченный доступ к образовательному контенту на портале знаний от корпоративного университета Подписка на лучшие электронные библиотеки с подборками IT-литературы (и не только) Собственный центр профессионального развития, в котором проводятся комплексные программы обучения hard skills Внутренние демодни, коуч-дни, питчи – то, что поможет продвигать и совершенствовать проекты и собственные идеи Корпоративные скидки для изучения английского языка в малых группах онлайн и офлайн Регулярные карьерные марафоны, индивидуальные карьерные консультации и планы развития Общение вне рабочих рамок – независимо от того, в каком городе ты работаешь! От участия в корпоративных спортивных сообществах до онлайн-экскурсий и неформальных встреч в формате Random coffee "
    },
    {
        "name": "Golang/Python developer",
        "salary": "от 250 000 до 300 000 ₽ на руки",
        "skills": [
            "Django",
            "Unit Testing",
            "Redis",
            "SQL",
            "Git",
            "Работа с базами данных",
            "MongoDB",
            "MS SQL",
            "Flask",
            "Backend",
            "REST",
            "Go",
            "Golang",
            "Docker",
            "Angular",
            "API",
            "Python",
            "Kubernetes",
            "REST API",
            "Clickhouse",
            "JSON"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Привет! Мы команда \"MIA Dev\" :)Сейчас мы расширяем нашу команду и рады принять специалистов на должность \"Golang и/или Python developer\".Чем предстоит заниматься:- Выполнение задач по разработке в согласованные сроки с высоким качеством- Проведение оценки трудозатрат и сроков реализации функционала- Определение и устранение технических и функциональных несоответствий разработанного ПО- Участие в разработке архитектурных решений для реализации бизнес задач- Участие в разработке технической документации (ТЗ, инструкции, руководства).- Разработка микросервисного проекта- Работа с высоконагруженными системами Наши ожидания:- Опыт разработки на стеке Golang (PostgreSQL, Kafka, Docker)- Опыт работы на Python (Angular будет плюсом)- Знание SQL и опыт работы с СУБД (PostgreSQL/MySQL) и NoSQL (Redis, Kafka, MongoDB)- Умение разрабатывать микросервисы- Опыт работы с высоконагруженными системами- Знание и умение применять SOLID принципы в разработке- Понимание и применение паттернов проектирования- Навыки тестирования приложений- Опыт работы с AWS/GCP сервисами- Понимание принципов микросервисной архитектурыГотовы предложить:- Оформление: ТК, ИП, ГПХ или СЗ- Комфортный доход по итогам собеседования (пересмотр заработной платы 2 раза в год)- 5-дневную рабочую неделю с гибким началом дня (8:00-11:00 по Мск)- Удобный формат работы: полная удаленка- Современные и интересные проекты- Возможность обучения и карьерного роста​​​​​​Оставляй свой отклик и до встречи на собеседовании!"
    },
    {
        "name": "Разработчик Python (Middle/Senior)",
        "salary": "",
        "skills": [],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "МЫ ПРЕДЛАГАЕМ:  работу в аккредитованной Минцифры IT-компании (резидент Сколково) с пакетом положенных льгот - ипотека по сниженной ставке, отсрочка от призыва в армию (для военнообязанных) и частичной мобилизации и т.д. стабильность: компания на рынке с 2008 года, входит в ТОП-50 лучших работодателей (рейтинг HH.ru) официальное трудоустройство, полностью белую з/п, ежегодную индексацию, ДМС работу с профессиональной командой IT-департамента, с наставниками, где ценят усилия и результаты каждого сотрудника, честны, открыты и уважительны друг к другу удаленный или гибридный формат работы карьерный рост и профессиональное развитие прокачку знаний и программы развития (внутреннее и внешнее обучение) дружелюбную атмосферу и развитую корпоративную культуру, где инициируем изменения и всегда готовы к любым вызовам ежегодные конференции, тимбилдинги, митапы и другие мероприятия; современный IT-ландшафт свободу действий в принятии решений без жесткого контроля «за спиной»  ЧЕМ ПРЕДСТОИТ ЗАНИМАТЬСЯ:  разработкой проекта на современном стеке (Celery, FastAPI, Tornado, PostgreSQL, RabbitMQ, Docker. Для разработки используем VS Code, Gitlab, Jira, Confluence) написанием асинхронного кода написанием тестов разработкой и поддержкой интеграционной шины для 20+ интегрированных сервисов  МЫ ОЖИДАЕМ ОТ ТЕБЯ:  проактивность и включенность в работу нестандартные решения и желание экспериментировать успешный опыт в разработке на Python 3.* (скоринговых карт, анти-фрод решений, интеграционной шины) участие в оценке задач, обсуждении вариантов решения  опыт работы с фреймворком (одним из: Celery, FastAPI, Tornado, Flask и др.), с брокерами сообщений (RabbitMQ, Kafka и др.), с SQL и реляционными базами данных, с экосистемой Docker/Docker-compose   умение писать асинхронный код   опыт разработки API   знание английского языка (умение свободно читать техническую документацию)   умение довести работу до конца в заданные сроки   желание развиваться     Ты нам – отклик и желание работать, Мы тебе – приглашение присоединиться к нашей крутой команде!"
    },
    {
        "name": "Ведущий программист Python",
        "salary": "",
        "skills": [
            "Git",
            "PostgreSQL",
            "ООП",
            "Linux",
            "JavaScript",
            "Django Framework",
            "jQuery",
            "Python"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Крупный региональный оператор фиксированной связи \"К Телеком\" приглашает принять участие в конкурсе на вакансию Программист Python. Язык программирования: Python, cherryPy/django. Пара слов о компании Компания «К Телеком» работает на телекоммуникационном рынке уже более 15-ти лет, мы предоставляем свои услуги в более чем 120 городах Свердловской, Челябинской областях и Пермском крае. Более 150 000 абонентов пользуются нашими услугами. Какие услуги предоставляет наша Компания? Высокоскоростной безлимитный интернет; видеонаблюдение; IP-телефония; телевидение; виртуальная АТС; организация виртуальных частных сетей (VPN); Wi-Fi Hot Spot; Co-location (размещение оборудования); продажа оптических волокон; промышленная автоматизация; M2M технологии (умный дом). Чем вам предстоит заниматься?  Расширение функционала внутренних сервисов Backend на python и частично Frontend; Поддержка существующих сервисов (личные кабинеты, биллинг); Разработка новых продуктов (веб стек, приложения на Python, проектирование бд).  Что мы ждем от кандидата?  Уверенное знание языка программирования Python; Уверенные знания баз данных (преимущественно MySQL, основы postgresql); Понимание стека веб технологий (Html, JS, CSS); Умение писать самодокументированный код; Приветствуется знание фреймворка cherryPy, django; Знание React, Redux будут плюсом; Уверенное знание Linux: ООП, MVC, понимание принципов построения REST API; Приветствуется опыт разработки мобильных приложений; Опыт работы с git будет плюсом; Умение работать на результат и брать на себя ответственность; Внимательность, стрессоустойчивость и исполнительность.  Почему именно МЫ? Работая в нашей компании, вы получаете:  Официальное трудоустройство согласно ТК РФ; Официальный и стабильный доход; С успешными кандидатами обсуждаем индивидуальные условия оплаты; Возможность удаленной занятости; Компенсацию питания; Работа в молодой, дружной, амбициозной, динамично развивающейся компании; Помощь в адаптации и решении сложных задач; Внутрикорпоративное обучение + возможность внешнего обучения; Перспективы профессионального и карьерного роста; Возможность реализации своих идей.  Мы заботимся о наших сотрудниках, предоставляя:  Выплату материальной помощи по случаю рождения детей; Новогодние подарки детям сотрудников на Новый год; Корпоративные и спортивные мероприятия, сплавы; Оплату предварительных и периодических медицинских осмотров. "
    },
    {
        "name": "Senior SDET (Python)",
        "salary": "",
        "skills": [
            "Python",
            "Gherkin"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "FaceApp is a global innovator in portrait perfection - blending advanced neural network technology with ease of use. Our team has leading expertise in machine learning and mobile interfaces, and our goal is to make mobile photography readily accessible to all mobile users beyond those with artistic professional skills. Our mission is to create the best yet easy-to-use selfie and portrait editor. Our workplace is a creative environment for developing high-quality products. We are looking for like-minded people who are ready to join our friendly and passionate team in Limassol (Cyprus). FaceApp is the most popular selfie editing app and the top app with more than 750M+ downloads. It offers a fantastic set of highly photorealistic filters with “simple for you and complicated in the background” photo processing achieved via single taps. The app is available in 34 languages for free and as a subscription on iOS and Android devices. A few facts about us:  TOP app at 154 countries for iOS and at 99 countries for Android (including USA, Great Britain, EU, Brazil, South East Asia); App of the Year at AppStore and Google Play; State-of-art technology photo editing.  We really appreciate our team and the relationships within it, and we hope that you, too, know how to build work in the key of a trusting and friendly atmosphere. If you are tech-savvy, ready to learn and grow as a professional - the FaceApp team is waiting for you! Now we are looking for an Senior SDET.   Responsibilities:  Design, develop, and support automated test scripts and frameworks to validate software applications across all our platforms and technologies; Develop and implement testing plans and strategies aligned with software development goals and timelines. This includes determining the scope and objectives of testing activities; Design and execute performance tests using appropriate tools to ensure that applications and systems meet performance criteria; Participate in security testing efforts to ensure software is free of vulnerabilities; Seamlessly integrate automated tests with CI/CD pipelines, promoting continuous testing and delivery; Detect, log, and efficiently manage software bugs and inconsistencies. Provide detailed reports and documentation on defects and steps to reproduce them; Work closely with design, development teams and other team members; Stay updated with the state-of-the-art testing tools, methodologies, and technologies, and strive for continuous enhancement of our testing frameworks and processes.  Our requirements:  Substantial experience in a software testing or development role, with a specific focus on automated testing; Proficiency in Python; Experience with automated testing tools and frameworks (e.g., Selenium, Appium, Gherkin, TestNG, JUnit); Solid understanding of RESTful APIs along with experience in testing web and mobile services using tools like Postman, SoapUI; Strong analytical and problem-solving skills; Good communication skills, including the ability to document tests and findings clearly; Ability to work well in a team as well as independently.    Why work at FaceApp?  Above market wages, formal employment and white wages; Cozy office, with a balcony that offers a breathtaking sea view; Health insurance; Compensation of costs for professional literature; Sports compensation; Compensation for the purchase of a mobile phone (once a year, 50% of the cost is compensated); Flexible start of the working day; Relocation to Cyprus (Limassol); Comfortable working conditions, a positive atmosphere, an open, informal corporate culture, and a friendly team; An excellent opportunity, together with a professional team, to solve interesting and complex problems, to create a product that is used by millions of people.  Embark on a journey with FaceApp, where you’ll be instrumental in molding the future of photo editing and enhancement. We are committed to a culture of innovation, creativity, and technological advancement. Apply today!    "
    },
    {
        "name": "Middle+ на Python",
        "salary": "от 180 000 ₽ на руки",
        "skills": [
            "Python",
            "Django",
            "PostgreSQL",
            "Jira",
            "Коммуникабельность",
            "Работа с базами данных",
            "TDD",
            "DDD",
            "Работа в команде",
            "RabbitMQ"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Мы готовы предложить:  Открытость руководства к вашим идеям и быструю коммуникацию без лишних согласований; Большой потенциал для профессионального и карьерного роста в компании; Отличный коллектив и дружеская атмосфера работы; Динамичный и быстроразвивающийся бизнес, ресурсы, возможность сделать вместе лучший продукт на рынке.  Чем предстоит заниматься:  Модернизация и оптимизация сайтов группы компании; Проектирование взаимодействия сайтов с ERP, CRM; Участие в создании новых проектов.  Что мы ждём от вас:  Опыт коммерческой разработки на Python от 3х лет; Знания принципов SOLID; Опыт работы в подходах Scram./Agile; Знание DDD как преимущество; Опыт проектирование баз данных (Postgres); Опыт работы с многопоточностью и асинхронностью (asyncio); Знание систем контроля версий (Git) и инструментов управления командой (Jira, Confluense); Понимание DevOps (CI/CD)принципов, как существенный плюс. "
    },
    {
        "name": "Middle Python Developer",
        "salary": "",
        "skills": [
            "Python",
            "Django Framework",
            "PostgreSQL",
            "Git",
            "Redis",
            "Unit Testing",
            "Docker",
            "RabbitMQ",
            "Asyncio",
            "Sanic",
            "Django REST",
            "Русский — C2 — В совершенстве",
            "Английский — C1 — Продвинутый"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Aviata — одна из лидирующих компаний в области бронирования и продажи авиабилетов в Казахстане. Наш сервис включен в рейтинг Forbes \"50 крупнейших интернет-компаний Казахстана\". Удостоились награды «Компания года — 2014» по результатам Национальной интернет-премии Award.kz. Оязанности:  Разработка web части сайтов; Разработка REST сервисов; Разработка микросервисов ; Разработка клиентов для работы со сторонними API; Написание unit тестов; Работа с фронтенд разработчиками; Проведение код ревью.  Требования:  Уверенное знание Python и одного из web фреймворков (Django/Sanic/Flask/FastApi и прочие); Умение писать асинхронный код с использование Asyncio; Знание принципов микросервисной архитектуры; Опыт работы с Web services и REST; Опыт работы с ОС *nix; Опыт работы с БД PostgreSQL/MySQL; Опыт работы с технологиями Redis, RabbitMQ, Docker, либо с их аналогами; Хорошее знание Gitflow; Умение писать чисты код (PEP-8), и применять принципы ООП, DRY; Знание и умение применять Design Patterns; Желание развиваться и создавать высоконугруженные сервисы; Умение писать безопасные приложения, не подверженные OWASP TOP 10.  Мы предлагаем:   Сильная команда. Ребята постоянно прокачиваются, много читают и любят свое дело. Мы гордимся не только тем, какие у нас профессионалы, но и тем какие они личности.   Обучение за счёт компании. Если хотите пройти курсы или пойти на конференцию, связанную с вашей областью, компания готова оплатить стоимость обучения.   Библиотека с профессиональной литературой. Мы регулярно обновляем список книг, которые можно читать в офисе и брать домой.    Комфортный офис. Мы переехали в новый офис, где создали еще больше приятных условий для работы: комната отдыха, разные места для работы. "
    },
    {
        "name": "Аналитик данных (SQL, Python)",
        "salary": "",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Работа в Правительстве Москвы — это возможность делать наш город современнее и удобнее. Если ты тоже неравнодушен к Москве, хочешь развивать ее и развиваться сам, присоединяйся к нашей команде! Обязанности:  Анализ больших объемов данных Написание запросов Визуализация полученных данных  Подготовка регулярной и внеплановой отчетности   Требования:  Высшее техническое образование Опыт в бизнес- или системном анализе не менее 2-х лет Уверенные навыки работы с SQL(оконные функции), Python (pandas, numpy, sklearn, pyspark), Excel (сводные таблицы, диаграммы) Опыт работы с BI-инструментами (QlikView, Tableau и др.) Знание стека GreenPlum, Spark (pyspark), Hadoop, AirFlow, DBT приветствуется Наличие практического опыта в решении бизнес-задач в области анализа данных Комплексное умение владеть задачей: от постановки до конечного результата по смыслу и по содержанию, нацеленность на решение задач для большого проекта Ответственность, многозадачность, коммуникабельность, стрессоустойчивость Готовность к переработкам     Условия:  Карьера в структуре Правительства Москвы Масштабные проекты  Возможность профессионального развития   Комфортный офис ст. м. Тропарево   График работы 5/2 с 10:00 до 19:00  "
    },
    {
        "name": "Аналитик данных (Excel,Python)",
        "salary": "",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Мы строим новую low-code платформу для аналитических сервисов Блока финансов Сбербанка класса Enterprise Performance Management (EPM) для перевода функционала систем с платформы SAP BI/BW/BPC для более чем 5000 пользователей Сбербанка и дочерних компаний. В единой платформе будут интегрированы данные 7 существующих систем общим объемом от 15 Тб с более чем 500 внешними потоками интеграций. При построении платформы будут использованы как Opensource решения (c значительными доработками), так и готовые технологические сервисы собственной платформы Сбербанка Platform V, а также значительный объем сервисов собственной разработки (для которых не найдено подходящих готовых решений) – для OLAP, планирования, прогнозирования, отчетности, dashbording, инструментов для аналитиков и продвинутых пользователей, ETL/DWH и другой смежной функциональности. В целевом состоянии предполагается расширение функционала прогнозирования/ планирования с помощью ML моделей. При миграции на целевую платформу одной из важнейших аналитических и методологических задач первого приоритета является построение полной, непротиворечивой и консистентной модели данных и структуры нормативно-справочной информации. Ищем бизнес/системного аналитика с опытом построения логической модели данных и выстраивания связей объектов нормативно-справочной информации. Основные задачи аналитика модели данных: 1. разработка моделей входящих и исходящих потов данных на основании информации, предоставленной в стандартизированном шаблоне. 2. анализ полноты и непротиворечивость данных по кросс-зависимым потокам. 3. разработка и развитие инструментов визуализации модели данных для всех стейкхолдеров. 4. консолидация аналитических разрезов всех потоков данных, из унификация и анализ применимости и актуальности для целевой платформы. Формирование видения перехода от перечня аналитических разрезов к перечню справочников. 5. формирование бизнес-требований на каждый справочник. 6. построение модели данных to be. Подготовка модели данных as is к миграции самих данных на целевую платформу. Что для нас важно: 1. опыт в анализе данных от 2х лет; 2. глубокое понимание принципов построения системы справочников. 3. опыт написания Бизнес требований к поставщикам данных и на разработку функциональности. 4. опыт написания технических заданий разработчикам. 5. знание Python на уровне построения массивов данных по заданным фильтра и условиям будет плюсом, но необязательное условие. 6. уверенное владение Excel (сводные таблицы, сложные формулы, статистический анализ). Soft skills: 1. ответственность 2. стрессоустойчивость 3. готовность к периодическим переработкам 4. дружелюбность 5. самостоятельность. Мы предлагаем: • официальное трудоустройство согласно ТК РФ • белая заработная плата: оклад + годовая премия • социальный пакет: ДМС, страхование от несчастных случаев, льготное кредитование • оздоровительные программы для детей сотрудников • возможность обучения за счет компании • выплаты материальной помощи в особых/чрезвычайных случаях; • дисконт-программы от компаний партнеров: фитнес, страхование, туризм • льготное кредитование • корпоративные цены на абонементы в крупные фитнес-сети."
    },
    {
        "name": "Python Developer (Payments)",
        "salary": "",
        "skills": [
            "Python",
            "Django Framework",
            "PostgreSQL",
            "Английский — B1 — Средний"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Ostrovok - travel-tech компания, создающая платформы онлайн-бронирования отелей, авиабилетов и других услуг как для индивидуальных путешественников, так и для корпоративных клиентов и тревел-агентств.Наши бренды: Ostrovok.ru, B2B.Ostrovok.ru, Ostrovok.ru Командировки. Мы развиваем проекты как в России, так и за рубежом. Мы ищем Middle+ Python разработчика в Payments - инфраструктура платежей в ETG. На этой позиции работа будет сфокусирована на проектах, требующих проработки, понимания взаимодействия сервисов, иногда оптимизации / доработки инфраструктуры:   подключение международных рекуррентных платежей с разработкой сопутствующей инфраструктуры;   улучшать расширяемость / работать над разделением ответственности между компонентами;     повышение гибкости и надежности существующих фич.   В конечном итоге цель - ускорение time to market за счет гибкости компонент, уменьшения взаимных зависимостей. Повышение надежности и оптимизация работы.Бэклог есть, каждый проект требует внимательной проработки. Ожидаем, что после онбординга и знакомства с кодом, творческую работу: проработку и обсуждение решения с командой, правки на основе критики, - кандидат может делать сам. Ключевые задачи:  развитие платежного сервиса ETG;  проектирование и разработка логики обработки платежей разных видов;   взаимодействие с сервисами - консьюмерами платежки;   подключение новых интеграций;   работа с асинхронными задачами и очередями;   оптимизация нагрузки.   Для этого тебе понадобится:   пишешь на Python (Django) от 3 лет, участвовал в коммерческих проектах;   работал с PostgreSQL;   работал с микросервисной архитектурой;   работал с Docker;   понимаешь, что ошибается каждый, поэтому не боишься этого, пишешь тесты и проверяешь, как работает твой код.   Плюсом будет:   опыт работы с командной строкой и Linux/MacOS;   опыт работы с СLI, PyCharm;   опыт разработки платежных систем.   Взамен мы предлагаем:  100% белая заработная плата;  комфортный офис в центре Москвы с зонами отдыха, безлимитным чаем/кофе и питанием;   гибридный формат работы: удалённо, из офиса или оба варианта;   гибкий график — мы не требуем в 9:00 быть в сети или в офисе. Можешь начинать работать в комфортное для тебя время;   интересные амбициозные задачи, которые выведут тебя на новый профессиональный уровень;   обучение: семинары, тренинги, конференции. Если ты сам хочешь выступать на конференциях — поможем всё организовать;   ДМС;   корпоративный английский, а также скидки на SkyEng;   крутые активности с коллегами: киновечера, викторины, тематические вечеринки, ежегодные выезды на природу, игры в футбол/волейбол;   корпоративные скидки на отели и другие услуги;   молодая активная команда классных специалистов.  "
    },
    {
        "name": "Python Developer (Gameplay)",
        "salary": "",
        "skills": [],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Lesta Games (ООО \"Гейм Стрим\" – Минский центр разработки) разрабатывает игровые проекты в различных жанрах, смело экспериментирует с инструментами и технологиями. В офисах компании в Санкт-Петербурге, Минске, Москве и Ташкенте работает более 1800 талантливых профессионалов. Мы делаем игры, которые стали настоящим культурным феноменом: «Мир танков», «Мир кораблей», Tanks Blitz, Royal Quest, а также работаем над новыми перспективными проектами.Мы не намерены останавливаться – впереди нас ждут новые вызовы и миллионы игроков.Готов вместе создавать будущее игровой индустрии? Добро пожаловать в команду! Сейчас мы активно ищем коллегу – Python Developer (Gameplay) в команду разработки Meta Stream проекта \"Мир танков\" для работы в минском офисе. Команда Meta Stream занимается разработкой «Мира танков», добавляет и поддерживает игровую функциональность в проекте, следит за внедрением новых технологий, внедряет актуальные dev практики, помогает в разборе инцидентов. В процессе работы команда взаимодействует с отделами оперирования, разработки, поддержки, maintenance, publishing и другими. Чем предстоит заниматься:   Доработкой и развитием существующих фичей. Разработкой новых фичей. Работой над улучшением стека разработки, кодовой базы. Работой с инцидентами, с техническим долгом. Покрытием функционала тестами. Проведением код-ревью.  Мы ожидаем:  Опыт коммерческой разработки на Python от 2-х лет; Опыт разработки асинхронных/многопоточных приложений. Уверенное знание основных алгоритмов и структур данных. Знание шаблонов проектирования. Навыки модульного тестирования и отладки. Умение работать в команде.  Будет плюсом:  Опыт работы в Gamedev.  Что мы предлагаем:  Работу в IT-компании (резидент ПВТ). Расширенный полис ДМС с первого месяца работы. Доплаты по больничным листам до 30 дней в году. Тренажёрный зал и душевые в офисе. Компенсацию спорта. Компенсацию стоимости питания в корпоративной столовой. Подарки и выплаты сотрудникам на значимые даты (первый день в компании, день рождения, свадьба, рождение детей). Комнаты отдыха с настолками, приставками, бильярдом, теннисными столами, а также релакс-зоны с массажными креслами. От 500 до 1000 ед. игрового золота на ваш аккаунт в игре ежедневно. Доставку сотрудников корпоративными шаттлами метро <-> офис «Волна» (Минск, Партизанский проспект, 178/2). Work-life balance: приходим в офис с 9 до 10, уходим с 18 до 19. "
    },
    {
        "name": "Trainee Python Developer",
        "salary": "",
        "skills": [
            "Python",
            "PostgreSQL",
            "SQL",
            "Django Framework",
            "Flask",
            "FastAPI",
            "ООП",
            "DRY",
            "Docker/Docker compose",
            "KISS",
            "SOLID",
            "REST",
            "Python Core",
            "Английский B1"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "WhiteSnake - активно развивающаяся IT-компания, специализирующаяся на разработке веб-приложений и IT-консалтинге. Присоединяйтесь к нам, чтобы быть на волне новейших технологий в backend разработке, Python, Data Science, Fintech, финансовом анализе, искусственном интеллекте, блокчейне и других актуальных областях. Вместе мы создаем современное будущее в IT. Мы ищем ответственного Trainee Python Developer в нашу команду. Мы ценим энтузиазм, стремление к развитию и готовы поддерживать вас на этом пути. Присоединяйтесь! Что для нас важно:   Уверенные знания языка Python и его основных фреймворков для веб разработки (Django/Flask/FastAPI).   Практический опыт от двух месяцев не в коммерческих проектах.   Понимание принципов ООП, DRY, KISS, SOLID, REST.   Знания SQL баз данных (PostgreSQL).   Знание Python Core и встроенной библиотеки.   Практический опыт работы с Docker/Docker compose.   Английский B1 и выше.   Большим плюсом будет:   Использование юнит-тестов (pytest).   Опыт работы с No-SQL хранилищами (MongoDB, DynamoDB, Redis).   Практический опыт в коммерческих проектах.   Условия работы и бонусы:   Просторный офис А класса в нескольких шагах от метро;   Оформление по ТК РБ;   Уютная кухня, где Вас ждут свежие фрукты, чай, кофе, печенье и перекусы, чтобы поддерживать энергию в течение дня;   Широкий спектр бенефитов, включая частичную компенсацию расходов на спорт, транспорт, медицину и т.д.;   Защищённая от инфляции заработная плата;   Оплачиваемые больничные (оплата по реальной заработной плате);   Молодой и дружный коллектив, где ценятся инновации и совместная работа;   Гибкий рабочий график, который поможет сохранить баланс между работой и личной жизнью;   Возможность изучать английский язык с нашим штатным преподавателем.  "
    },
    {
        "name": "Middle/Senior Python Разработчик",
        "salary": "",
        "skills": [],
        "experience": "более 6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Требования:  Опыт работы в разработке ПО не менее 3 лет Flask, FastAPI, pytest, AWS, Yandex Cloud, ООП, SOLID, Рефакторинг кода, Английский язык, Django Framework, Английский — C1 — Продвинутый. Понимание MVC, алгоритмов и структур данных, объектно-ориентированного и функционального программирования, шаблонов разработки, взаимодействий с большими данными Опыт построения архитектуры проектов (монолитные и микросервисные архитектуры). Опыт разработки клиент-серверных приложений (REST, JSON) Умение работать с ORM, с миграциями, и писать сложные SQL команды Аналитические способности: оценка разработки, оценка производительности алгоритма и компонентов системы Умение самостоятельно анализировать и решать технические задачи. Глубокое понимание технологий и архитектурных решений в области разработки ПО, способность предоставлять техническое руководство и поддержку команде. Опыт в планировании проектов разработки ПО, умение распределять задачи, устанавливать приоритеты и следить за выполнением сроков Знание методов тестирования и контроля качества ПО, опыт в проведении код-ревью и аудита кода Знание систем контроля версий (например, Git) и опыт работы с непрерывной интеграцией и непрерывной доставкой (CI/CD). Хорошие коммуникативные навыки и способность работать в команде. Опыт работы с Python, Java 17, IBM Webpshere(WPS, WID, Websphere MQ), Опыт работы с базами данных (PostgreSQL, SQL), Springboot, Spring security Jenkins+gitlab, Python, JS, Angular, React, Vue, Apache Kafka, Centos, Debian, Docker, Redis, RabbitMQ, Clickhouse, MongoDB, Centrifugo, Keycloak, API Gateway, Nginx, Gunicorn.  Функциональные обязанности:  Разработка и поддержка сервисов на Python с использованием фреймворков и библиотек Django, Django REST, FastAPI и Celery; Разработка и поддержка сервисов на языке программирования Java 17, IBM Webpshere(WPS, WID, Websphere MQ), Springboot, Spring security, работа с БД (ORACLE, Postgresql). Построение и оптимизация архитектуры систем; Оптимизация алгоритмов и структур данных под высоконагруженную систему Оптимизация базы и SQL запросов Работы с многопоточными и многопроцессорными задачами Взаимодействие с командой, участие в разработке продукта, улучшение кода Организация работы разработчиков, распределение задач и контроль выполнения. Обеспечение эффективного взаимодействия между участниками команды. Обеспечение технической экспертизы и поддержки членов команды. Решение технических проблем и вопросов, возникающих в процессе разработки. Участие в планировании разработки ПО, определение ресурсов (людских и временных) для выполнения проекта. Координация работы команды в соответствии с установленными сроками и требованиями. Обеспечение высокого уровня качества кода и конечного продукта. Проведение код-ревью, тестирование и анализ результатов. Взаимодействие с заказчиком о представлении результатов работы команды, отчетность о выполнении задач и достижении целей.  Условия:  Обучение и прохождение курсов повышения квалификации (в том числе международного образца) работникам; Лечебное пособие для оздоровления к оплачиваемому ежегодному трудовому отпуску в размере 2 (двух) должностных окладов; Материальная помощь по памятным событиям; Современный и комфортабельный офис; Утренняя и вечерняя развозка служебными автобусами, которые курсируют по всем районам столицы; Полная занятость с графиком работы с 9.00 до 18.30, 5/2. "
    },
    {
        "name": "Middle Python Developer (remote)",
        "salary": "",
        "skills": [
            "Python"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, удаленная работа"
        ],
        "description": "Utair – крупный российский авиационный холдинг. Самолёты Utair обслуживают 140 направлений в России, из них — 75 уникальные, и перевозят более 6 млн пассажиров в год. Вертолётный парк - крупнейший в мире, с самой большой грузоподъемностью флота. Utair IT – дочерняя ИТ-компания группы Utair. Мы разрабатываем и обслуживаем все информационные системы Utair, делаем сервисы для пассажиров удобнее и быстрее, повышаем эффективность производственных процессов с помощью ИТ-продуктов. О нас Наш коллектив специализируется на авиационных технологиях. Команда разработки состоит из шести человек и мы в поисках Middle Python Developer, которому будет интересно внести вклад в улучшение сервисов авиакомпании. Мы нацелены на достижение высокой доступности и быстрой поставки сервисов при минимальных затратах на разработку. Бэкенд у нас базируется на микросервисной архитектуре, все крутится в Kubernetes-кластере, а для взаимодействия между сервисами используем Apache Kafka, gRPC. Пишем на Python и Go, используем Framework FastAPI/flask, а также работаем с различными базами данных: Mongo DB, PostgreSQL, Greenplum, ClickHouse. Работаем по Kanban – для решения задачи можем собираться мини-командой, а можем делать каждый свое. Чем предстоит заниматься   Участие в создании новых коммерческих сервисов авиакомпании и улучшение тех, что есть: регистрация, личный кабинет, бронирование перелетов и т.д. Проектирование отказоустойчивого и высокопроизводительного программного обеспечения, которое легко поддерживать и сопровождать Оценка технического долга, планирование, рефакторинг и разработка нового API для мобильного приложения, веб-сайта и внутренних систем  Кто нам подойдет   От двух лет опыта разработки на Python Понимание основных принципов разработки ПО, CI/CD, юнит-тестирования Хорошее знание: Python 3, Asyncio, Shell, Git, Flask, FastApi, Celery, Mongo DB, Apache Kafka, Redis, паттернов проектирования Навыки работы с системами мониторинга HA/HL систем (Prometheus, Grafana, ELK) Опыт разработки на Golang приветствуется  Мы предлагаем   Работу в аккредитованной ИТ-компании, оформление в соответствии с ТК РФ  Участие в обсуждении задач, возможность предлагать свои идеи и совместные решения Удаленный формат, мы работаем по UTC+3 MSK, 5ти дневная рабочая неделя ДМС, авиабилеты по льготным ценам для вас и вашей семьи Корпоративное обучение, курсы, конференции     "
    },
    {
        "name": "Backend-Developer Python (senior)",
        "salary": "",
        "skills": [
            "Python",
            "PostgreSQL",
            "SQL",
            "async",
            "Docker",
            "tornado",
            "aiohttp",
            "fastapi",
            "Flask"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Привет! Мы — онлайн-школа Тетрика, являемся одной из крупнейших EdTech-компаний России в сегменте школьного образования.За 5 лет мы помогли уже тысячам школьников найти своего репетитора и провели более 2 млн занятий на собственной платформе. Мы продолжаем расти, а значит, нам нужны новые таланты. Сейчас мы приглашаем в свою команду Backend-Developer Python (senior), который будет отвечать за совершенствование нашего продукта. Чем предстоит заниматься:  Создавать инструменты, которые усовершенствуют процесс обучения для учеников и репетиторов; Участвовать в принятии архитектурных решений и развитии системы с точки зрения инфраструктуры; Осуществлять интеграцию с внешними сервисами (CRM-система, Helpdesk, системы обратной связи с пользователем); Рефакторинг и улучшение текущей кодовой базы, написание тестов.  Стек:  Python 3.11; tornado + asyncpg, aiohttp/fastapi/flask (для микросервисов); PostgreSQL, Redis; Docker, k8s.    Что мы ожидаем от кандидата:  Наличие опыта в веб-разработке от 5-х лет; Уверенное владение python3 (async, typing/pydantic); Знание инструментов работы с кодом: ruff, black, mypy; Понимание принципов работы HTTP(S)/REST, Websockets; Отличные знания SQL, опыт оптимизации медленных запросов; Навыки работы с *-nix системами и основы контейнеризации (Docker); Способность оценивать и декомпозировать задачи.    Что мы предлагаем:  Работа в офисе/удаленно с гибким началом рабочего дня (с 9:00 до 11:00); ДМС со стоматологией после 3 месяцев работы; Льготная ИТ-ипотека и отсрочка (входим в реестр аккредитованных ИТ-компаний); Оформление в соответствии с ТК РФ; Возможность обучения сотрудника и его детей со скидкой 50% на нашей платформе; Корпоративные скидки от наших партнёров; Уютный офис в шаговой доступности от метро Курская на территории креативного кластера Artplay.  Процесс найма:Интервью с рекрутером → два технических собеседования → интервью с руководителем → оффер.Если тебе интересны новые задачи и постоянное развитие, смело отправляй отклик на вакансию. Пожалуйста, расскажи немного о себе и укажи зарплатные ожидания. Будем рады знакомству :)"
    },
    {
        "name": "Backend-разработчик (Python, Django)",
        "salary": "от 180 000 ₽ на руки",
        "skills": [
            "Python",
            "Django Framework",
            "PostgreSQL",
            "ImageProxy",
            "Linux",
            "Git",
            "RabbitMQ",
            "Redis",
            "Nginx",
            "API",
            "Celery",
            "Django",
            "REST API"
        ],
        "experience": "3–6 лет",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "В IT компанию требуется backend разработчик (Python/Django) Наш стек: Python 3.x, Django, Django REST framework, Open API, PostgreSQL, RabbitMQ, Celery, Redis, Docker, Nginx, Grafana, Gitlab Чем предстоит заниматься: - Взаимодействовать с командой (обсуждение требований, груминг и декомпозиция задач) - Разрабатывать, тестировать и поддерживать API для фронтенд-приложений, мобильных приложений и сторонних систем - Выполнять code review - Заниматься рефакторингом Что ожидаем от кандидата: - Опыт коммерческой разработки от 4-х лет - Навык анализа и поддержки чужого кода - Понимание принципов построения RESTful API - Продвинутый опыт разработки на Django REST framework - Глубокое понимание Django ORM, умение анализировать и оптимизировать sql-запросы - Опыт написания тестов в PyTest (+ FactoryBoy + Faker или аналоги)  - Умение работать с очередями задач Celery в django-проектах - Навыки использования Git, Git-flow - Опыт контейнеризации приложений Django (Docker, docker-compose) - Понимание принципов CI/CD и Twelve Factor App - Понимание принципов ООП и SOLID - Знание Английского языка на уровне чтения технической документации Будет плюсом: - Хорошее понимание Linux (ssh, bash, iptables, make и т.д.) - Опыт работы с веб-сокетами в Django - Знание HTML, CSS, JavaScript (верстать не надо, просто понимать) - Опыт парсинга html на python - Опыт взаимодействия с API TG, VK, OK и т.д. - Опыт логирования и отладки сервисов в продакшн-режиме (Open Telemetry, Grafana+Tempo, SigNoz) - Опыт работы с GitLab CI/CD - Опыт использования сервисов управления проектами Jira, Yandex Tracker - Опыт наставничества Условия:- Удаленная работа- ДМС после прохождения испытательного срока (3 месяца);"
    },
    {
        "name": "Junior Python-разработчик",
        "salary": "",
        "skills": [],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Международный iGaming бренд в поисках Junior/Middle Python-разработчика Обязанности:   Разработка и поддержка парсеров;   Добыча и структурирование данных из различных источников (Twitter API, Telegram, и др.) для поддержки и развития сервисов на базе AI;   Взаимодействие с разработчиками и аналитиками для оптимизации процессов сбора данных.   Требования:   Опыт работы с Python и соответствующими библиотеками (requests, beautifulsoup4, selenium, os, sys, json, copy, datetime, operator, shutil, inspect, pdfkit и т.д.);   Опыт работы с системами контроля версий (например, Git);   Навык работы с Ubuntu и Docker;   Опыт работы с технической документацией и требованиями;   Проведение code-review (умение разбираться в чужом коде);   Умение писать понятный код и архитектуру.   Будет плюсом:   Опыт работы с системами обработки больших данных;   Опыт работы с реляционными базами данных.   Условия:  Комфортный офис в Москва Сити; График: 5/2 с гибким началом дня; Лояльное руководство и минимум формализма и бюрократии; Необходимое оборудование и инструменты для эффективной работы; Активная и интересная корпоративная жизнь. "
    },
    null,
    null,
    {
        "name": "Middle/Senior Python Developer",
        "salary": "",
        "skills": [
            "Python",
            "Django Framework",
            "REST",
            "FastAPI",
            "DRF",
            "Celery"
        ],
        "experience": "1–3 года",
        "employment_mode": [
            "Полная занятость, полный день"
        ],
        "description": "Мы специализируемся на разработке веб-сервисов, отказоустойчивых бэк-ендов и мобильных приложениях для крупного российского бизнеса, помогая им. Наша компания входит в реестр аккредитованных IT-компаний. В расширение команды ищем Python разработчика. У нас интересные проекты, известные клиенты и квалифицированные коллеги. Работая с нами, ты сможешь вырасти как специалист, и в бою опробовать все современные технологии. Качество продукта для нас - определяющий фактор. Поэтому каждый разработчик имеет чёткую специализацию в рамках своего стэка. Также есть возможность развития в других направлениях разработки. Мы будем рады рассмотреть твою кандидатуру, если у тебя есть:   Опыт работы с Django/DRF/FastApi; Плотно работал с PostgreSQL; Работал с одним или несколькими: Redis/Clickhouse; Работал и понимаешь как проходит взаимодействие с месседж-брокерами, знаком с одним из: Celery/Kafka/RabbitMQ; Отлично разбираешься в REST архитектуре; Понимаешь как работать с асинхронностью (AioHTTP/asyncio) Умеешь писать SQL-запросы без использования ORM; Понимаешь как устроена микросервисная архитектура;  Будет плюсом, если ты:   Знаком или работал с:  Oracle DB SQLAlchemy   Проектировал или работал с микросервисной архитектурой; Писал unit-тесты; Имеешь опыт работы с gRPC;  Дополнительно приветствуется:   Опыт участия в высоконагруженных проектах Опыт работы с Docker-compose, GitLab CI, OpenShift или Kubernetes.  Почему с нами здорово:  ДМС со стоматологией; Гибкое начало рабочего дня; Удаленная работа, гибрид или офис на твое усмотрение; Большой, современный, светлый офис 400 м2 в центре города; Мы заинтересованы в твоем развитии, поэтому предлагаем роадмап для каждого сотрудника; Пересмотр и индексация зарплаты каждые полгода; Современное оборудование для работы; Корпоративный английский язык; Сертификация, оплата обучения, посещения конференций и т.п.; Менторство более опытных коллег; Тихая набережная в 5 минутах ходьбы, для прогулок; Компенсация занятий спортом; Увлекательная корпоративная жизнь, тимбилдинги, совместный просмотр фильмов, квизы и много всего интересного; Игровая зона с консолью и настолками, которую можно посетить в любой момент рабочего дня "
    }
]